sqwsummerwind/Contiki-Arduino/apps/esp8266/mqtt.cpp
/*
 * Min and Max event numbers we want to acknowledge while we're in the process
 * of doing something else. continue_send does not count, therefore must be
 * allocated last
 */
static process_event_t mqtt_event_min;
static process_event_t mqtt_event_max;
/*---------------------------------------------------------------------------*/
static void reset_packet(struct mqtt_in_packet *packet);
/*---------------------------------------------------------------------------*/
LIST(mqtt_conn_list);
/*---------------------------------------------------------------------------*/
PROCESS(mqtt_process, "MQTT process");
/*---------------------------------------------------------------------------*/
PROCESS(tcp_input_process, "tcp input process");
/*---------------------------------------------------------------------------*/
static void
call_event(struct mqtt_connection *conn,
           mqtt_event_t event,
           void *data)
{

  if(conn->event_callback)
	 conn->event_callback(conn, event, data);
  if (conn->app_process) {
	  //process_post(conn->app_process, mqtt_update_event, NULL);
	  process_post(conn->app_process, event, NULL);
  }
	
}
/*---------------------------------------------------------------------------*/
static void
reset_defaults(struct mqtt_connection *conn)
{
  conn->mid_counter = 1;
  PT_INIT(&conn->out_proto_thread);
  conn->waiting_for_pingresp = 0;

  reset_packet(&conn->in_packet);
  conn->out_buffer_sent = 0;
}
/*---------------------------------------------------------------------------*/
static void
abort_connection(struct mqtt_connection *conn)
{
  conn->out_buffer_ptr = conn->out_buffer;
  conn->out_queue_full = 0;

  /* Reset outgoing packet */
  memset(&conn->out_packet, 0, sizeof(conn->out_packet));

  conn->espClient->stop();

  conn->state = MQTT_CONN_STATE_NOT_CONNECTED;
}
/*---------------------------------------------------------------------------*/
static void
connect_tcp(struct mqtt_connection *conn)
{
  conn->state = MQTT_CONN_STATE_TCP_CONNECTING;

  reset_defaults(conn);
  int result = conn->espClient->connect(conn->server_ip,conn->server_port);
  //connect to server successfully
  if (result==1) {
	  conn->state = MQTT_CONN_STATE_TCP_CONNECTED;
	  conn->out_buffer_sent = 1;

	  process_post(&mqtt_process, mqtt_do_connect_mqtt_event, conn);

	  //suqiangwei 2017-12-07 wait for data from server
	  process_post(&tcp_input_process, mqtt_do_tcp_input_event, conn);
  }
  else {
	  //DBG("MQTT - Disconnected by tcp event %d\n", event);
	  process_post(&mqtt_process, mqtt_abort_now_event, conn);
	  conn->state = MQTT_CONN_STATE_NOT_CONNECTED;
  }
}
/*---------------------------------------------------------------------------*/
static void
handle_ping_timeout(struct mqtt_connection *conn)
{
  conn->state = MQTT_CONN_STATE_DISCONNECTING;
  //tcp_socket_close(&(conn->socket));
  //tcp_socket_unregister(&conn->socket);
  DBG("MQTT - handle pint time out,disconnect mqtt\n");
  process_post(&mqtt_process, mqtt_abort_now_event, conn);
  //memset(&conn->socket, 0, sizeof(conn->socket));

}
/*---------------------------------------------------------------------------*/
static void
send_out_buffer(struct mqtt_connection *conn)
{
  if(conn->out_buffer_ptr - conn->out_buffer == 0) {
    conn->out_buffer_sent = 1;
    return;
  }
  conn->out_buffer_sent = 0;

  DBG("MQTT - (send_out_buffer) Space used in buffer: %i\n",
      conn->out_buffer_ptr - conn->out_buffer);
  DBG("MQTT - (send_out_buffer) out_buffer_index: %i\n",
	  conn->out_buffer_index);

  //tcp_socket_send(&conn->socket, conn->out_buffer,conn->out_buffer_ptr - conn->out_buffer);
  size_t size = conn->out_buffer_ptr - conn->out_buffer - conn->out_buffer_index;
  DBG("MQTT - (send_out_buffer) write size: %i\n",size);

  size_t bytes_writen = conn->espClient->write((const char*)(conn->out_buffer+conn->out_buffer_index),size);
  DBG("MQTT - (send_out_buffer) writen size: %i\n", bytes_writen);

  if (bytes_writen==size) {
	  conn->out_buffer_sent = 1;
	  conn->out_buffer_ptr = conn->out_buffer;
	  conn->out_buffer_index = 0;
	  /* suqiangwei 2017-12-07 
	   * when send out data in buffer, restart keep_alive_timer
	   */
	  ctimer_restart(&conn->keep_alive_timer);

  }
  else {
	  conn->out_buffer_index += bytes_writen;
  }
}
/*---------------------------------------------------------------------------*/
static void
string_to_mqtt_string(struct mqtt_string *mqtt_string, char *string)
{
  if(mqtt_string == NULL) {
    return;
  }
  mqtt_string->string = string;

  if(string != NULL) {
    mqtt_string->length = strlen(string);
  } else {
    mqtt_string->length = 0;
  }
}
/*---------------------------------------------------------------------------*/
static int
write_byte(struct mqtt_connection *conn, uint8_t data)
{
  DBG("MQTT - (write_byte) buff_size: %i write: '%02X'\n",
      &conn->out_buffer[MQTT_TCP_OUTPUT_BUFF_SIZE] - conn->out_buffer_ptr,
      data);

  if(&conn->out_buffer[MQTT_TCP_OUTPUT_BUFF_SIZE] - conn->out_buffer_ptr == 0) {
    send_out_buffer(conn);
    return 1;
  }

  *conn->out_buffer_ptr = data;
  conn->out_buffer_ptr++;
  return 0;
}
/*---------------------------------------------------------------------------*/
static int
write_bytes(struct mqtt_connection *conn, uint8_t *data, uint16_t len)
{
  uint16_t write_bytes;
  write_bytes =
    MIN(&conn->out_buffer[MQTT_TCP_OUTPUT_BUFF_SIZE] - conn->out_buffer_ptr,
        len - conn->out_write_pos);

  memcpy(conn->out_buffer_ptr, &data[conn->out_write_pos], write_bytes);
  conn->out_write_pos += write_bytes;
  conn->out_buffer_ptr += write_bytes;

  DBG("MQTT - (write_bytes) len: %u write_pos: %lu\n", len,
      conn->out_write_pos);

  if(len - conn->out_write_pos == 0) {
    conn->out_write_pos = 0;
    return 0;
  } else {
    send_out_buffer(conn);
    return len - conn->out_write_pos;
  }
}
/*---------------------------------------------------------------------------*/
static void
encode_remaining_length(uint8_t *remaining_length,
                        uint8_t *remaining_length_bytes,
                        uint32_t length)
{
  uint8_t digit;

  DBG("MQTT - Encoding length %lu\n", length);

  *remaining_length_bytes = 0;
  do {
    digit = length % 128;
    length = length / 128;
    if(length > 0) {
      digit = digit | 0x80;
    }

    remaining_length[*remaining_length_bytes] = digit;
    (*remaining_length_bytes)++;
    DBG("MQTT - Encode len digit '%u' length '%lu'\n", digit, length);
  } while(length > 0 && *remaining_length_bytes < 5);
  DBG("MQTT - remaining_length_bytes %u\n", *remaining_length_bytes);
}
/*---------------------------------------------------------------------------*/
static void
keep_alive_callback(void *ptr)
{
  struct mqtt_connection *conn = (struct mqtt_connection *)ptr;

  DBG("MQTT - (keep_alive_callback) Called!\n");

