sqwsummerwind/Contiki-Arduino/apps/esp8266/mqtt.cpp
  send_out_buffer(conn);

  /* Start timeout for reply. */
  conn->waiting_for_pingresp = 1;

  /* Wait for PINGRESP or timeout */
  reset_packet(&conn->in_packet);
  timer_set(&conn->t, RESPONSE_WAIT_TIMEOUT);

  PT_WAIT_UNTIL(pt, conn->in_packet.packet_received || timer_expired(&conn->t));

  /*suqiangwei 2017-12-07*/
  /*time out without respone*/
  if (timer_expired(&conn->t)&&!conn->in_packet.packet_received) {

	  handle_ping_timeout(conn);
  }

  reset_packet(&conn->in_packet);

  conn->waiting_for_pingresp = 0;

  PT_END(pt);
}

/*---------------------------------------------------------------------------*/
static
PT_THREAD(puback_pt(struct pt *pt, struct mqtt_connection *conn))
{
	PT_BEGIN(pt);

	DBG("MQTT - Sending PUBACK\n");

	/* Write Fixed Header */
	PT_MQTT_WRITE_BYTE(conn, MQTT_FHDR_MSG_TYPE_PUBACK);
	PT_MQTT_WRITE_BYTE(conn, 0x02);
	PT_MQTT_WRITE_BYTE(conn, (conn->in_packet.mid >> 8));
	PT_MQTT_WRITE_BYTE(conn, (conn->in_packet.mid & 0x00FF));

	send_out_buffer(conn);

	//reset in_packet
	DBG("MQTT - (handle_publish) resetting packet.\n");
	reset_packet(&conn->in_packet);

	PT_END(pt);
}
/*---------------------------------------------------------------------------*/
static void
handle_connack(struct mqtt_connection *conn)
{
  DBG("MQTT - Got CONNACK\n");

  if(conn->in_packet.payload[1] != 0) {
    PRINTF("MQTT - Connection refused with Return Code %i\n",
           conn->in_packet.payload[1]);
    call_event(conn,
               MQTT_EVENT_CONNECTION_REFUSED_ERROR,
               &conn->in_packet.payload[1]);
    abort_connection(conn);
    return;
  }

  conn->out_packet.qos_state = MQTT_QOS_STATE_GOT_ACK;

  ctimer_set(&conn->keep_alive_timer, conn->keep_alive * CLOCK_SECOND,
             keep_alive_callback, conn);

  /* Always reset packet before callback since it might be used directly */
  conn->state = MQTT_CONN_STATE_CONNECTED_TO_BROKER;
  call_event(conn, MQTT_EVENT_CONNECTED, NULL);
}
/*---------------------------------------------------------------------------*/
static void
handle_pingresp(struct mqtt_connection *conn)
{
  DBG("MQTT - Got PINGRESP\n");
}
/*---------------------------------------------------------------------------*/
static void
handle_suback(struct mqtt_connection *conn)
{
  struct mqtt_suback_event suback_event;

  DBG("MQTT - Got SUBACK\n");

  /* Only accept SUBACKS with X topic QoS response, assume 1 */
  if(conn->in_packet.remaining_length > MQTT_MID_SIZE +
     MQTT_MAX_TOPICS_PER_SUBSCRIBE * MQTT_QOS_SIZE) {
    DBG("MQTT - Error, SUBACK with > 1 topic, not supported.\n");
  }

  conn->out_packet.qos_state = MQTT_QOS_STATE_GOT_ACK;

  suback_event.mid = (conn->in_packet.payload[0] << 8) |
    (conn->in_packet.payload[1]);
  suback_event.qos_level = (mqtt_qos_level_t)conn->in_packet.payload[2];
  conn->in_packet.mid = suback_event.mid;

  if(conn->in_packet.mid != conn->out_packet.mid) {
    DBG("MQTT - Warning, got SUBACK with none matching MID. Currently there is"
        "no support for several concurrent SUBSCRIBE messages.\n");
  }

  /* Always reset packet before callback since it might be used directly */
  call_event(conn, MQTT_EVENT_SUBACK, &suback_event);
}
/*---------------------------------------------------------------------------*/
static void
handle_unsuback(struct mqtt_connection *conn)
{
  DBG("MQTT - Got UNSUBACK\n");

  conn->out_packet.qos_state = MQTT_QOS_STATE_GOT_ACK;
  conn->in_packet.mid = (conn->in_packet.payload[0] << 8) |
    (conn->in_packet.payload[1]);

  if(conn->in_packet.mid != conn->out_packet.mid) {
    DBG("MQTT - Warning, got UNSUBACK with none matching MID. Currently there is"
        "no support for several concurrent UNSUBSCRIBE messages.\n");
  }

  call_event(conn, MQTT_EVENT_UNSUBACK, &conn->in_packet.mid);
}
/*---------------------------------------------------------------------------*/
static void
handle_puback(struct mqtt_connection *conn)
{
  DBG("MQTT - Got PUBACK\n");

  conn->out_packet.qos_state = MQTT_QOS_STATE_GOT_ACK;
  conn->in_packet.mid = (conn->in_packet.payload[0] << 8) |
    (conn->in_packet.payload[1]);

  call_event(conn, MQTT_EVENT_PUBACK, &conn->in_packet.mid);
}
/*---------------------------------------------------------------------------*/
static void
handle_publish(struct mqtt_connection *conn)
{
  DBG("MQTT - Got PUBLISH, called once per manageable chunk of message.\n");
  DBG("MQTT - Handling publish on topic '%s'\n", conn->in_publish_msg.topic);

  DBG("MQTT - This chunk is %i bytes\n", conn->in_packet.payload_pos);

  //suqiangwei 2017-12-07 supported qos 0 and 1
  if(((conn->in_packet.fhdr & 0x06) >> 1) > 1) {
    PRINTF("MQTT - Error, got incoming PUBLISH with QoS > 1, not supported atm!\n");
  }

  call_event(conn, MQTT_EVENT_PUBLISH, &conn->in_publish_msg);

  if(conn->in_publish_msg.first_chunk == 1) {
    conn->in_publish_msg.first_chunk = 0;
  }

  /* If this is the last time handle_publish will be called, reset packet. */
  if(conn->in_publish_msg.payload_left == 0) {

    /* Check for QoS and initiate the reply, do not rely on the data in the
     * in_packet being untouched. */

	//for qos 1 ,send PUBACK and reset in_packet
	if (((conn->in_packet.fhdr & 0x06) >> 1) == 1) {
		process_post(&mqtt_process, mqtt_do_puback_event, conn);
	}

  }
}
/*---------------------------------------------------------------------------*/
// reads a byte into result
static boolean readByte(struct mqtt_connection *conn, uint8_t * result) {
	uint32_t previousMillis = millis();
	while (!conn->espClient->available()) {
		uint32_t currentMillis = millis();
		if (currentMillis - previousMillis >= ((int32_t)MQTT_SOCKET_TIMEOUT * 1000)) {
			return false;
		}
	}
	*result = conn->espClient->read();
	return true;
}
/*---------------------------------------------------------------------------*/
static boolean 
parse_publish_vhdr(struct mqtt_connection *conn,
                   uint32_t *pos,int input_data_len)
{
  uint16_t copy_bytes;
  uint8_t byte;

  /* Read out topic length */
  if(conn->in_packet.topic_len_received == 0) {
	  if (!readByte(conn, &byte)) {
		  return false;
	  }
	  conn->in_packet.topic_len = byte << 8;
	  (*pos)++;
    conn->in_packet.byte_counter++;
	conn->in_packet.topic_len_received = 1;
    if(*pos >= input_data_len) {
		return false;
    }
  }
  if (conn->in_packet.topic_len_received == 1) {
	  if (!readByte(conn,&byte)) {
		  return false;
	  }
	  conn->in_packet.topic_len |= byte;
	  (*pos)++;
	  conn->in_packet.byte_counter++;
	  conn->in_packet.topic_len_received = 2;

	  DBG("MQTT - Read PUBLISH topic len %i\n", conn->in_packet.topic_len);
	  /* WARNING: Check here if TOPIC fits in payload area, otherwise error */
  }

  /* Read out topic */
  if(conn->in_packet.topic_len_received == 2 &&
     conn->in_packet.topic_received == 0) {
    copy_bytes = MIN(conn->in_packet.topic_len - conn->in_packet.topic_pos,
                     input_data_len - *pos);
    DBG("MQTT - topic_pos: %i copy_bytes: %i", conn->in_packet.topic_pos, copy_bytes);

	int read_bytes = conn->espClient->read((uint8_t*)(&conn->in_publish_msg.topic[conn->in_packet.topic_pos]),
		copy_bytes);
	if (copy_bytes != read_bytes) {
		//return false;
		copy_bytes = read_bytes;
	}
    (*pos) += copy_bytes;
    conn->in_packet.byte_counter += copy_bytes;
    conn->in_packet.topic_pos += copy_bytes;

    if(conn->in_packet.topic_len - conn->in_packet.topic_pos == 0) {
      DBG("MQTT - Got topic '%s'", conn->in_publish_msg.topic);
      conn->in_packet.topic_received = 1;
      conn->in_publish_msg.topic[conn->in_packet.topic_pos] = '\0';
	  //2 for topic name length
      conn->in_publish_msg.payload_length =
		  conn->in_publish_msg.payload_length - conn->in_packet.topic_len - 2;
      conn->in_publish_msg.payload_left = conn->in_publish_msg.payload_length;
    }

