sqwsummerwind/Contiki-Arduino/apps/esp8266/mqtt.cpp
    /* Set this once per incomming publish message */
    conn->in_publish_msg.first_chunk = 1;
  }
  
  return conn->in_packet.topic_received == 1;
}
/*---------------------------------------------------------------------------*/


//handle packet
static void handle_packet(struct mqtt_connection *conn) {
	/* Debug information */
	DBG("\n");
	/* Take care of input */
	DBG("MQTT - Finished reading packet!\n");
	/* What to return? */
	DBG("MQTT - total data was %i bytes of data. \n",
		(MQTT_FHDR_SIZE + conn->in_packet.remaining_length_bytes + conn->in_packet.remaining_length));

	/* Handle packet here. */
	switch (conn->in_packet.fhdr & 0xF0) {
	case MQTT_FHDR_MSG_TYPE_CONNACK:
		handle_connack(conn);
		break;
	case MQTT_FHDR_MSG_TYPE_PUBLISH:
		/* This is the only or the last chunk of publish payload */
		conn->in_publish_msg.payload_chunk = conn->in_packet.payload;
		conn->in_publish_msg.payload_chunk_length = conn->in_packet.payload_pos;
		conn->in_publish_msg.payload_left = 0;
		handle_publish(conn);
		break;
	case MQTT_FHDR_MSG_TYPE_PUBACK:
		handle_puback(conn);
		break;
	case MQTT_FHDR_MSG_TYPE_SUBACK:
		handle_suback(conn);
		break;
	case MQTT_FHDR_MSG_TYPE_UNSUBACK:
		handle_unsuback(conn);
		break;
	case MQTT_FHDR_MSG_TYPE_PINGRESP:
		handle_pingresp(conn);
		break;

		/* QoS 2 not implemented yet */
	case MQTT_FHDR_MSG_TYPE_PUBREC:
	case MQTT_FHDR_MSG_TYPE_PUBREL:
	case MQTT_FHDR_MSG_TYPE_PUBCOMP:
		call_event(conn, MQTT_EVENT_NOT_IMPLEMENTED_ERROR, NULL);
		PRINTF("MQTT - Got unhandled MQTT Message Type '%i'",
			(conn->in_packet.fhdr & 0xF0));
		break;

	default:
		/* All server-only message */
		PRINTF("MQTT - Got MQTT Message Type '%i'", (conn->in_packet.fhdr & 0xF0));
		break;
	}
}

PROCESS_THREAD(tcp_input_process, ev, data)
{
	static struct mqtt_connection *conn; 
  uint32_t input_data_len = 0;
  uint8_t digit = 0;
  uint32_t pos = 0;
  uint32_t copy_bytes = 0;
  uint8_t byte;

  PROCESS_BEGIN();
  while (1) {
	  PROCESS_WAIT_EVENT_UNTIL(ev == mqtt_do_tcp_input_event);
	  conn = (struct mqtt_connection *)data;
	  //data available
	  input_data_len = conn->espClient->available();

	  if (input_data_len) {

		  if (conn->in_packet.packet_received) {
			  reset_packet(&conn->in_packet);
		  }

		  DBG("tcp_input with %i bytes of data:\n", input_data_len);

		  /* Read the fixed header field, if we do not have it */
		  if (!conn->in_packet.fhdr) {
			  if (!readByte(conn, &byte)) {
				  goto end;
			  }
			  conn->in_packet.fhdr = byte;
			  conn->in_packet.byte_counter++;

			  DBG("MQTT - Read VHDR '%02X'\n", conn->in_packet.fhdr);

			  if (++pos >= input_data_len) {
				  goto end;
			  }
		  }

		  /* Read the Remaining Length field, if we do not have it */
		  if (!conn->in_packet.has_remaining_length) {
			  do {
				  if (pos >= input_data_len) {
					  goto end;
				  }

				  if (!readByte(conn, &byte)) {
					  goto end;
				  }
				  conn->in_packet.byte_counter++;
				  conn->in_packet.remaining_length_bytes++;
				  DBG("MQTT - Read Remaining Length byte\n");

				  if (conn->in_packet.byte_counter > 5) {
					  call_event(conn, MQTT_EVENT_ERROR, NULL);
					  DBG("Received more then 4 byte 'remaining lenght'.");
					  goto end;
				  }

				  conn->in_packet.remaining_length +=
					  (byte & 127) * conn->in_packet.remaining_multiplier;
				  conn->in_packet.remaining_multiplier *= 128;
				  pos++;
			  } while ((byte & 128) != 0);

			  DBG("MQTT - Finished reading remaining length byte\n");
			  conn->in_packet.has_remaining_length = 1;
		  }

		  /*
		  * Check for unsupported payload length. Will read all incoming data from the
		  * server in any case and then reset the packet.
		  *
		  * TODO: Decide if we, for example, want to disconnect instead.
		  */
		  if ((conn->in_packet.remaining_length > MQTT_INPUT_BUFF_SIZE) &&
			  (conn->in_packet.fhdr & 0xF0) != MQTT_FHDR_MSG_TYPE_PUBLISH) {

			  PRINTF("MQTT - Error, unsupported payload size for non-PUBLISH message\n");

			  conn->in_packet.byte_counter += input_data_len;
			  if (conn->in_packet.byte_counter >=
				  (MQTT_FHDR_SIZE + conn->in_packet.remaining_length)) {
				  conn->in_packet.packet_received = 1;
			  }
			  goto end;
		  }

		  //init payload length
		  conn->in_publish_msg.payload_length = conn->in_packet.remaining_length;
		  conn->in_publish_msg.payload_left = conn->in_publish_msg.payload_length;

		  /*
		  * Supported payload, reads out both VHDR and Payload of all packets.
		  *
		  * Note: There will always be at least one byte left to read when we enter
		  *       this loop.
		  */
		  while (conn->in_packet.byte_counter <
			  (MQTT_FHDR_SIZE + conn->in_packet.remaining_length_bytes + conn->in_packet.remaining_length)) {

			  if ((conn->in_packet.fhdr & 0xF0) == MQTT_FHDR_MSG_TYPE_PUBLISH &&
				  conn->in_packet.topic_received == 0) {
				  parse_publish_vhdr(conn, &pos, input_data_len);
			  }

			  /*read publish mid ,only for qos level > 0*/
			  if (conn->in_packet.topic_received == 1 &&
				  (conn->in_packet.fhdr & 0x06) == MQTT_QOS_LEVEL_1 << 1 && conn->in_packet.mid_len_received < 2) {

				  /* Read out topic length */
				  if (conn->in_packet.mid_len_received == 0) {
					  if (!readByte(conn, &byte)) {
						  goto end;
					  }
					  conn->in_packet.mid = byte << 8;
					  pos++;
					  conn->in_packet.byte_counter++;
					  conn->in_packet.mid_len_received = 1;
					  if (pos >= input_data_len) {
						  goto end;
					  }
				  }
				  if (conn->in_packet.mid_len_received == 1) {
					  if (!readByte(conn, &byte)) {
						  goto end;
					  }
					  conn->in_packet.mid |= byte;
					  pos++;
					  conn->in_packet.byte_counter++;
					  conn->in_packet.mid_len_received = 2;

					  //2 is for mid
					  conn->in_publish_msg.payload_length -= 2;
					  conn->in_publish_msg.payload_left -= 2;
					  DBG("MQTT - Read PUBLISH mid  %i\n", conn->in_packet.mid);
					  /* WARNING: Check here if TOPIC fits in payload area, otherwise error */
				  }

			  }

			  /* Read in as much as we can into the packet payload */
			  copy_bytes = MIN(input_data_len - pos, MQTT_INPUT_BUFF_SIZE - conn->in_packet.payload_pos);
			  copy_bytes = MIN(copy_bytes, conn->in_publish_msg.payload_left);
			  DBG("- Copied %lu payload bytes\n", copy_bytes);
			  /*memcpy(&conn->in_packet.payload[conn->in_packet.payload_pos],
				  &input_data_ptr[pos],
				  copy_bytes);*/
			  int read_bytes = conn->espClient->read((uint8_t*)(&conn->in_packet.payload[conn->in_packet.payload_pos]),
				  copy_bytes);
			  copy_bytes = copy_bytes == read_bytes ? copy_bytes : read_bytes;

			  conn->in_packet.byte_counter += copy_bytes;
			  conn->in_packet.payload_pos += copy_bytes;
			  conn->in_publish_msg.payload_left -= copy_bytes;
			  pos += copy_bytes;

			  uint8_t i;
			  DBG("MQTT - Copied bytes: \n");
			  for (i = 0; i < copy_bytes; i++) {
				  DBG("%02X ", conn->in_packet.payload[i]);
			  }
			  DBG("\n");

			  /* Full buffer, shall only happen to PUBLISH messages. */
			  if (MQTT_INPUT_BUFF_SIZE - conn->in_packet.payload_pos == 0) {
				  conn->in_publish_msg.payload_chunk = conn->in_packet.payload;
				  conn->in_publish_msg.payload_chunk_length = MQTT_INPUT_BUFF_SIZE;
				  //conn->in_publish_msg.payload_left -= MQTT_INPUT_BUFF_SIZE;

				  handle_publish(conn);

				  conn->in_publish_msg.payload_chunk = conn->in_packet.payload;
				  conn->in_packet.payload_pos = 0;
			  }

			  if (pos >= input_data_len &&
				  (conn->in_packet.byte_counter < (MQTT_FHDR_SIZE + conn->in_packet.remaining_length_bytes + conn->in_packet.remaining_length))) {
				  goto end;
			  }
		  }

		  //deal with packet, using for alon function for switch
		  handle_packet(conn);

