sqwsummerwind/Contiki-Arduino/apps/esp8266/mqtt.cpp
		  conn->in_packet.packet_received = 1;
	  }

  end:

	  process_post(&tcp_input_process, ev, data);
  }
  PROCESS_END();
}
/*---------------------------------------------------------------------------*/
PROCESS_THREAD(mqtt_process, ev, data)
{
  static struct mqtt_connection *conn;

  PROCESS_BEGIN();

  while(1) {
    PROCESS_WAIT_EVENT();

    if(ev == mqtt_abort_now_event) {
      DBG("MQTT - Abort\n");
      conn = (struct mqtt_connection *)data;
      conn->state = MQTT_CONN_STATE_ABORT_IMMEDIATE;
	  ctimer_stop(&conn->keep_alive_timer);
      abort_connection(conn);
	  call_event(conn, MQTT_EVENT_DISCONNECTED, NULL);

	  /* If connecting retry */
	  if (conn->auto_reconnect == 1) {
		  connect_tcp(conn);
	  }
    }
    if(ev == mqtt_do_connect_tcp_event) {
      conn = (struct mqtt_connection *)data;
      DBG("MQTT - Got mqtt_do_connect_tcp_event!\n");
      connect_tcp(conn);
    }
    if(ev == mqtt_do_connect_mqtt_event) {
      conn = (struct mqtt_connection *)data;
      //conn->socket.output_data_max_seg = conn->max_segment_size;
      DBG("MQTT - Got mqtt_do_connect_mqtt_event!\n");

      if(conn->out_buffer_sent == 1) {
        PT_INIT(&conn->out_proto_thread);
        while(connect_pt(&conn->out_proto_thread, conn) < PT_EXITED &&
              conn->state != MQTT_CONN_STATE_ABORT_IMMEDIATE) {
          PT_MQTT_WAIT_SEND();
        }
      }
	  else if (conn->out_buffer_sent != 1) {
		  send_out_buffer(conn);
	  }
    }
    if(ev == mqtt_do_disconnect_mqtt_event) {
      conn = (struct mqtt_connection *)data;
      DBG("MQTT - Got mqtt_do_disconnect_mqtt_event!\n");

      /* Send MQTT Disconnect if we are connected */
      if(conn->state == MQTT_CONN_STATE_SENDING_MQTT_DISCONNECT) {
        if(conn->out_buffer_sent == 1) {
          PT_INIT(&conn->out_proto_thread);
          while(conn->state != MQTT_CONN_STATE_ABORT_IMMEDIATE &&
                disconnect_pt(&conn->out_proto_thread, conn) < PT_EXITED) {
            PT_MQTT_WAIT_SEND();
          }
          abort_connection(conn);
          call_event(conn, MQTT_EVENT_DISCONNECTED, &ev);
        } else {
			//fixed me
			send_out_buffer(conn);
			process_post(&mqtt_process, mqtt_do_disconnect_mqtt_event, conn);
        }
      }
    }
    if(ev == mqtt_do_pingreq_event) {
      conn = (struct mqtt_connection *)data;
      DBG("MQTT - Got mqtt_do_pingreq_event!\n");

      if(conn->out_buffer_sent == 1 &&
         conn->state == MQTT_CONN_STATE_CONNECTED_TO_BROKER) {
        PT_INIT(&conn->out_proto_thread);
        while(conn->state == MQTT_CONN_STATE_CONNECTED_TO_BROKER &&
              pingreq_pt(&conn->out_proto_thread, conn) < PT_EXITED) {
          PT_MQTT_WAIT_SEND();
        }
      }
	  else if (conn->out_buffer_sent != 1) {
		  send_out_buffer(conn);
	  }
    }
    if(ev == mqtt_do_subscribe_event) {
      conn = (struct mqtt_connection *)data;
      DBG("MQTT - Got mqtt_do_subscribe_mqtt_event!\n");

      if(conn->out_buffer_sent == 1 &&
         conn->state == MQTT_CONN_STATE_CONNECTED_TO_BROKER) {
        PT_INIT(&conn->out_proto_thread);
        while(conn->state == MQTT_CONN_STATE_CONNECTED_TO_BROKER &&
              subscribe_pt(&conn->out_proto_thread, conn) < PT_EXITED) {
          PT_MQTT_WAIT_SEND();
        }
      }
	  else if (conn->out_buffer_sent != 1) {
		  send_out_buffer(conn);
	  }
    }
    if(ev == mqtt_do_unsubscribe_event) {
      conn = (struct mqtt_connection *)data;
      DBG("MQTT - Got mqtt_do_unsubscribe_mqtt_event!\n");

      if(conn->out_buffer_sent == 1 &&
         conn->state == MQTT_CONN_STATE_CONNECTED_TO_BROKER) {
        PT_INIT(&conn->out_proto_thread);
        while(conn->state == MQTT_CONN_STATE_CONNECTED_TO_BROKER &&
              unsubscribe_pt(&conn->out_proto_thread, conn) < PT_EXITED) {
          PT_MQTT_WAIT_SEND();
        }
      }
	  else if (conn->out_buffer_sent != 1) {
		  send_out_buffer(conn);
	  }
    }
    if(ev == mqtt_do_publish_event) {
      conn = (struct mqtt_connection *)data;
      DBG("MQTT - Got mqtt_do_publish_mqtt_event!\n");

      if(conn->out_buffer_sent == 1 &&
         conn->state == MQTT_CONN_STATE_CONNECTED_TO_BROKER) {
        PT_INIT(&conn->out_proto_thread);
        while(conn->state == MQTT_CONN_STATE_CONNECTED_TO_BROKER &&
              publish_pt(&conn->out_proto_thread, conn) < PT_EXITED) {
          PT_MQTT_WAIT_SEND();
        }
	  }
	  else if(conn->out_buffer_sent!=1){
		  send_out_buffer(conn);
	  }
    }
	if (ev == mqtt_do_puback_event) {
		conn = (struct mqtt_connection *)data;
		DBG("MQTT - Got mqtt_do_puback_mqtt_event!\n");

		if (conn->out_buffer_sent == 1 &&
			conn->state == MQTT_CONN_STATE_CONNECTED_TO_BROKER) {
			PT_INIT(&conn->out_proto_thread);
			while (conn->state == MQTT_CONN_STATE_CONNECTED_TO_BROKER &&
				puback_pt(&conn->out_proto_thread, conn) < PT_EXITED) {
				PT_MQTT_WAIT_SEND();
			}
		}
		else if (conn->out_buffer_sent != 1) {
			send_out_buffer(conn);
		}
	}
  }
  PROCESS_END();
}
/*---------------------------------------------------------------------------*/
void
mqtt_init(void)
{
  static uint8_t inited = 0;
  if(!inited) {
    mqtt_do_connect_tcp_event = process_alloc_event();
    mqtt_event_min = mqtt_do_connect_tcp_event;

    mqtt_do_connect_mqtt_event = process_alloc_event();
    mqtt_do_disconnect_mqtt_event = process_alloc_event();
    mqtt_do_subscribe_event = process_alloc_event();
    mqtt_do_unsubscribe_event = process_alloc_event();
    mqtt_do_publish_event = process_alloc_event();
    mqtt_do_pingreq_event = process_alloc_event();
    mqtt_update_event = process_alloc_event();
    mqtt_abort_now_event = process_alloc_event();
	mqtt_do_puback_event = process_alloc_event();
	mqtt_do_tcp_input_event = process_alloc_event();
    mqtt_event_max = mqtt_do_tcp_input_event;

    mqtt_continue_send_event = process_alloc_event();

    list_init(mqtt_conn_list);
    process_start(&mqtt_process, NULL);
	/*suqiangwei 2017-12-07 start tcp input process*/
	process_start(&tcp_input_process, NULL);
    inited = 1;
  }
}
/*---------------------------------------------------------------------------*/
mqtt_status_t
mqtt_register(struct mqtt_connection *conn, struct process *app_process,
              char *client_id, mqtt_event_callback_t event_callback,
              WiFiClient *espClient)
{
  if(strlen(client_id) < 1) {
    return MQTT_STATUS_INVALID_ARGS_ERROR;
  }

  /* Set defaults - Set all to zero to begin with */
  memset(conn, 0, sizeof(struct mqtt_connection));
  string_to_mqtt_string(&conn->client_id, client_id);
  conn->event_callback = event_callback;
  conn->app_process = app_process;
  conn->auto_reconnect = 1;
  //conn->max_segment_size = max_segment_size;
  conn->espClient = espClient;
  reset_defaults(conn);

  mqtt_init();
  list_add(mqtt_conn_list, conn);

  DBG("MQTT - Registered successfully\n");

